public/IT/Docwriting/Sysanalyses/Notation/UML/Component/README.md
```
flowchart LR
    WebUI[Web UI]
    ApiGateway[API Gateway]
    ApplicationService[Application Service]
    NotificationService[Notification Service]
    Database[(База данных)]

    WebUI --> ApiGateway
    ApiGateway --> ApplicationService
    ApplicationService --> Database
    ApplicationService --> NotificationService
```
